"""
1. Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.
"""
import sys

motivation, work_hours, hour_price, prize = sys.argv
print(sys.argv)
print((int(work_hours) * int(hour_price)) + int(prize))